import React from "react";
function Post() {
    return (
        <>
            <div className="App">
                <h1>ชุดแห่งการแก้แค้น</h1>
                <div class="d-flex flex-column mb-3 border m-3">
                    <div class="p-2 m-3 border bg-warning">ประวัติความเป็นมา/ที่มาของชุดแห่งการแก้แค้น</div>
                    <h2>เปิดตัวท่ามกลางเสียงฮือฮา เมื่อ เจ้าหญิงไดอาน่า สวมเดรสดำ ร่วมงานเลี้ยง หลังจากแยกทางกับ เจ้าฟ้าชายชาร์ลส์ ซึ่งชุดนี้เป็นหนึ่งในแฟชั่นที่มีชื่อเสียงที่สุดในประวัติศาสตร์ 
                        ด้วยเหตุผลหลายประการ และถูกเรียกขานในนามว่า ‘ชุดแก้แค้น’ ชุดสุดโด่งดัง ‘Revenge Dress’ แปลตรงตัวอย่างไม่ต้องปรับคำให้สวยหรูว่า ‘ชุดแก้แค้น’ เปิดตัวสู่สาธารณะ
                        ในเดือนมิถุนายน ปีค.ศ. 1994 โดยชุดนี้โดดเด่นด้วยรูปทรงขนาดเล็กสไตล์ชุดค็อกเทล ดีไซน์เปิดไหล่เผยให้เห็นความเซ็กซี่ และมีชายกระโปรงยาวออกมา ลุคนี้เจ้าหญิงไดอาน่าทรงจับคู่ชุดกับส้นสูงสีดำคลาสสิกและสร้อยคอไข่มุกเจ็ดเส้นพร้อมไพลินขนาดใหญ่ รวมถึงเข็มกลัดเพชร ซึ่งเป็นของขวัญจากพระมารดา</h2>
<img src="http://mgt2.pnu.ac.th/tinata/6460704009revege%20dress.jpg" alt="My image" width={200}
  height={300} />
                    <div class="p-2 m-3 border bg-success">รูปภาพเจ้าหญิงไดอาน่า ใน ปี 1994</div>
                    <h2>ชุดแก้แค้นของเจ้าหญิงไดอาน่า เป็นหนึ่งในแฟชั่นที่มีชื่อเสียงที่สุดในประวัติศาสตร์ด้วยเหตุผลหลายประการ 
                        ประการแรกในช่วงเวลาที่เจ้าหญิงไดอาน่าถูกถ่ายภาพในชุดเดรสสีดำอันเป็นสัญลักษณ์นี้ เจ้าฟ้าชายชาร์ลส์ 
                        อดีตพระสวามีของพระองค์ กำลังสารภาพทางโทรทัศน์แห่งชาติ ว่าไม่ซื่อสัตย์ในชีวิตคู่และยอมรับถึงความสัมพันธ์อันลึกซึ้งกับ 
                        คามิลล่า พาร์เกอร์ โบลด์ (ปัจจุบันคือดัชเชสแห่งคอร์นวอลล์) </h2>

                        <h1>ที่มาของข้อมูล : https://praew.com/luxury/royal-update/372330.html </h1>


                    <div class="p-2 m-3 border bg-primary">Flex item 3</div>
                </div>
            </div>
        </>
    );
}
export default Post;